<?php

namespace App\Services;

use GuzzleHttp\Client;

class NutritionalValue
{
    /**
     * メソッド説明
     * 検索ワードを渡すと、栄養価APIのレスポンスを配列で返す。
     * 
     * @var string
     * @return array
     */
    // public function searchFoods ($number, $weight)
    public function searchFoods ($number)
    {
        // Guzzleのオブジェクトを生成
        // [第１引数] URL
        // [第２引数] GETリクエストのクエリパラメータ
        $client = new Client();
    

        // 栄養価APIからのレスポンスを格納
        $response = $client
                    // ->get('https://script.google.com/macros/s/AKfycbx7WZ-wdIBLqVnCxPwzedIdjhC3CMjhAcV0MufN2gJd-xsO3xw/exec?num=&weight=');
            ->get('https://script.google.com/macros/s/AKfycbx7WZ-wdIBLqVnCxPwzedIdjhC3CMjhAcV0MufN2gJd-xsO3xw/exec', [
                'query' => [
                    'num'    => $number,
                    'weight' => '100',
                    // 'weight' => 100,
                    // 'weight' => $weight,
                ],
            ]);

            // [tinkerでレスポンス確認]
            //
            // >>> $foods->searchFoods('01001', '100')
            // => [
            //      "食品名" => "アマランサス 玄穀",
            //      "廃棄率" => 0,
            //      "エネルギー（kcal）" => 358,
            //      "エネルギー（kj）" => 1498,
            //      "水分" => 13.5,
            //      "たんぱく質" => 12.7,
            //      "アミノ酸組成によるたんぱく質" => 12.5,
            //      "脂質" => 6,
            //      "トリアシルグリセロール当量" => 5,
            //      "飽和脂肪酸" => 1.18,
            //      "一価不飽和脂肪酸" => 1.48,
            //      "多価不飽和脂肪酸" => 2.1,
            //      "コレステロール" => 0,
            //      "炭水化物" => 64.9,
            //      "利用可能炭水化物（単糖当量）" => 63.5,
            //      "水溶性食物繊維" => 1.1,
            //      "不溶性食物繊維" => 6.3,
            //      "食物繊維総量" => 7.4,
            //      "灰分" => 2.9,
            //      "ナトリウム" => 1,
            //      "カリウム" => 600,
            //      "カルシウム" => 160,
            //      "マグネシウム" => 270,
            //      "リン" => 540,
            //      "鉄" => 9.4,
            //      "亜鉛" => 5.8,
            //      "銅" => 0.92,
            //      "マンガン" => 6.14,
            //      "ヨウ素" => 1,
            //      "セレン" => 13,
            //      "クロム" => 7.0,
            //      "モリブデン" => 59,
            //      "レチノール" => 0,
            //      "α0カロテン" => 0,
            //      "β0カロテン" => 2,
            //      "β0クリプトキサンチン" => 0,
            //      "β0カロテン当量" => 2,
            //      "レチノール活性当量" => 0,
            //      "ビタミンD" => 0,
            //      "α0トコフェロール" => 1.3,
            //      "β0トコフェロール" => 2.3,
            //      "γ0トコフェロール" => 0.2,
            //      "δ0トコフェロール" => 0.7,
            //      "ビタミンK" => 0,
            //      "ビタミンB1" => 0.04,
            //      "ビタミンB2" => 0.14,
            //      "ナイアシン" => 1,
            //      "ビタミンB6" => 0.58,
            //      "ビタミンB12" => 0,
            //      "葉酸" => 130,
            //      "パントテン酸" => 1.69,
            //      "ビオチン" => 16.3,
            //      "ビタミンC" => 0,
            //      "食塩相当量" => 0,
            //      "アルコール" => 0,
            //      "硝酸イオン" => 0,
            //      "テオブロミン" => 0,
            //      "カフェイン" => 0,
            //      "タンニン" => 0,
            //      "ポリフェノール" => 0,
            //      "酢酸" => 0,
            //      "調理油" => 0,
            //      "有機酸" => 0,
            //      "重量変化率" => 0,
            //    ]
            // >>> 

        // APIからのレスポンスは、JSON形式なので、
        // PHPで扱いやすいように配列に変換する
        return json_decode($response->getBody()->getContents(), true);
    }
}